# IFCGuidKey Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCGuidKey Constructor
IFCGuidKey Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IFCGuidKey(String) | Constructs a new IFCHybridGuid |
| IFCGuidKey(IFCGuidKey) | IFCGuidKey can be used in managed code as well as unmanaged. |

# See Also
IFCGuidKey Class
IFCGuidKey Members
Autodesk.Revit.DB.IFC Namespace